FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
        // Activate buzzer - set the GPIO pin that controls the buzzer
        HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_SET);

        printf("\n\rR2D Sound: Started\n\r");
    }
}

/**
 * @brief Update the Ready-To-Drive sound state
 * @details Checks if R2D sound needs to be stopped based on timing
 *          requirements (1-3 seconds continuous sound).
 */
void UpdateR2DSound(void) {
    // If sound is playing, check if it's time to stop
    if (vcu.r2d_sound_playing) {
        uint32_t current_time = HAL_GetTick();
        uint32_t elapsed_time = current_time - vcu.r2d_sound_start_time;

        // Sound duration: 2 seconds (2000 ms)
        if (elapsed_time >= 1000) {
            // Stop the sound
            HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
            vcu.r2d_sound_playing = false;
            vcu.r2d_sound_completed = true;

            printf("\n\rR2D Sound: Completed\n\r");
        }
    }
}

/**
 * @brief Reset the Ready-To-Drive sound state
 * @details Resets the R2D sound flags when leaving a ready state.
 */
void ResetR2DSound(void) {
    vcu.r2d_sound_playing = false;
    vcu.r2d_sound_completed = false;
    HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
}

/**
 * @brief Start playing the Emergency sound
 * @details This function activates the buzzer to play an intermittent emergency sound
 *          with frequency 1-5Hz, 50% duty cycle, for 8-10 seconds.
 */
void StartEmergencySound(void) {
    // Only start if not already playing
    if (!vcu.emergency_sound_playing && !vcu.emergency_sound_completed) {
        vcu.emergency_sound_playing = true;
        vcu.emergency_sound_start_time = HAL_GetTick();
        vcu.emergency_sound_last_toggle = HAL_GetTick();
        vcu.emergency_sound_state = true;  // Start with buzzer ON

        // Activate buzzer
        HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_SET);

        printf("\n\rEmergency Sound: Started\n\r");
    }
}

/**
 * @brief Update the Emergency sound state
 * @details Manages the intermittent pattern (1-5Hz, 50% duty cycle) and duration (8-10s)
 *          of the emergency sound.
 */
void UpdateEmergencySound(void) {
    if (vcu.emergency_sound_playing) {
        uint32_t current_time = HAL_GetTick();
        uint32_t total_elapsed_time = current_time - vcu.emergency_sound_start_time;
        uint32_t toggle_elapsed_time = current_time - vcu.emergency_sound_last_toggle;

        // Using 2.5Hz frequency (200ms ON, 200ms OFF)
        const uint32_t TOGGLE_INTERVAL_MS = 200;

        // Toggle buzzer state at specified frequency (2.5Hz)
        if (toggle_elapsed_time >= TOGGLE_INTERVAL_MS) {
            vcu.emergency_sound_state = !vcu.emergency_sound_state;
            HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin,
                              vcu.emergency_sound_state ? GPIO_PIN_SET : GPIO_PIN_RESET);
            vcu.emergency_sound_last_toggle = current_time;
        }

        // Total sound duration: 9 seconds
        const uint32_t EMERGENCY_SOUND_DURATION_MS = 9000;

        // Stop sound after duration completes
        if (total_elapsed_time >= EMERGENCY_SOUND_DURATION_MS) {
            // Stop the sound
            HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
            vcu.emergency_sound_playing = false;
            vcu.emergency_sound_completed = true;

            printf("\n\rEmergency Sound: Completed\n\r");
        }
    }
}

/**
 * @brief Reset the Emergency sound state
 * @details Resets the emergency sound flags when leaving the emergency state.
 */
void ResetEmergencySound(void) {
    vcu.emergency_sound_playing = false;
    vcu.emergency_sound_completed = false;
    vcu.emergency_sound_state = false;
    HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
}

/**
 * @brief Handle emergency stop condition
 * @details Sounds the buzzer with required pattern if an emergency stop is detected
 */
void HandleEmergencyStop(void) {
    if (vcu.AS_emergency) {
        // Start emergency sound if not already playing or completed
        if (!vcu.emergency_sound_playing && !vcu.emergency_sound_completed) {
            StartEmergencySound();
            // Disable R2D state
            vcu.r2d_toggle_signal = false;
            vcu.r2d_autonomous_signal = false;
        }

        // Update emergency sound pattern
        UpdateEmergencySound();
    } else {
        // Reset emergency sound state when emergency condition clears
        ResetEmergencySound();
    }
}

/* -------------------- STATE MACHINE FUNCTIONS -------------------- */
/**
 * @brief Print state transition for debugging
 * @param from Previous state
 * @param to New state
 */
void print_state_transition(VCU_STATE_t from, VCU_STATE_t to) {
    printf("\n\rState transition: %s -> %s\n", state_names[from], state_names[to]);
}

/**
 * @brief Update the state of the VCU based on inputs and conditions
 */
void UpdateState(void) {
    // Store current state for change detection
    previous_state = current_state;

    // Process emergency condition with highest priority
    if (vcu.AS_emergency && current_state != STATE_AS_EMERGENCY) {
        current_state = STATE_AS_EMERGENCY;
        return;  // Exit early - emergency takes precedence
    }

    // Read raw button state
    bool current_r2d_button = HAL_GPIO_ReadPin(int2_r2d_GPIO_Port, int2_r2d_Pin);

    // Detect rising edge (button press) for toggle behavior
    if (current_r2d_button && !vcu.r2d_button_prev) {
        vcu.r2d_toggle_signal = !vcu.r2d_toggle_signal;  // Toggle on button press
    }

    // Store current button state for next iteration
    vcu.r2d_button_prev = current_r2d_button;

    // Also store the raw button signal for any code that still needs it
    vcu.r2d_button_signal = current_r2d_button;

    vcu.ignition_switch_signal = HAL_GPIO_ReadPin(int1_ign_GPIO_Port, int1_ign_Pin);
    vcu.ignition_ad = 0;

