FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
            static uint32_t last_can_send_time_manuel = 0;
            uint32_t current_time_manuel = HAL_GetTick();

            if (current_time_manuel - last_can_send_time_manuel >= 5) {
                can_bus_send_HV500_SetDriveEnable(1, &hcan2);
                can_bus_send_HV500_SetRelCurrent(result.percentage_1000, &hcan2);
                last_can_send_time_manuel = current_time_manuel;
            }

            break;

        case STATE_READY_AUTONOMOUS:
            // Forward autonomous commands to inverter
            static uint32_t last_can_send_time_auto = 0;
            uint32_t current_time_auto = HAL_GetTick();

            if (current_time_auto - last_can_send_time_auto >= 5) {
                can_bus_send_HV500_SetDriveEnable(1, &hcan3);
                // TODO: need to reveive the rpm from the pc
                // can_bus_send_HV500_SetERPM(result.percentage_1000, &hcan3);
                can_bus_send_AdBus_RPM(myHV500.Actual_ERPM, &hcan3);
                last_can_send_time_auto = current_time_auto;
            }
            break;

        case STATE_AS_EMERGENCY:
            // Activate emergency indicators
            // Handle emergency state
            HandleEmergencyStop();
            break;
    }
}

/* -------------------- COMMUNICATION FUNCTIONS -------------------- */
/**
 * @brief CAN RX FIFO0 message pending callback
 * @param hcan Pointer to CAN handle
 */
void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan) {
    if (HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK) {
        Error_Handler();
        if (hcan->Instance == CAN1) {
            can_data1.id = RxHeader.StdId;
            can_data1.length = RxHeader.DLC;
            for (int i = 0; i < RxHeader.DLC; i++) {
                can_data1.message[i] = RxData[i];
            }
            can1_rx_flag = true;

        } else if (hcan->Instance == CAN2) {
            can_data2.id = RxHeader.StdId;
            can_data2.length = RxHeader.DLC;
            for (int i = 0; i < RxHeader.DLC; i++) {
                can_data2.message[i] = RxData[i];
            }
            can2_rx_flag = true;

        } else if (hcan->Instance == CAN3) {
            can_data3.id = RxHeader.StdId;
            can_data3.length = RxHeader.DLC;
            for (int i = 0; i < RxHeader.DLC; i++) {
                can_data3.message[i] = RxData[i];
            }
            can3_rx_flag = true;
        }
    }
}

/**
 * @brief Redirect printf to UART
 */
PUTCHAR_PROTOTYPE {
    /* Place your implementation of fputc here */
    /* e.g. write a character to the USART1 and Loop until the end of transmission */
    HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, 0xFFFF);

    return ch;
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {
    /* USER CODE BEGIN 1 */
    current_state = STATE_INIT;
    /* USER CODE END 1 */

    /* MPU Configuration--------------------------------------------------------*/
    MPU_Config();

    /* Enable the CPU Cache */

    /* Enable I-Cache---------------------------------------------------------*/
    SCB_EnableICache();

    /* Enable D-Cache---------------------------------------------------------*/
    SCB_EnableDCache();

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    // HAL_ADC_Start_DMA(&hadc3, (uint32_t *)&adc_buffer, 5);

    // HAL_ADC_Start(&hadc3);

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_ADC3_Init();
    MX_CAN1_Init();
    MX_ADC1_Init();
    MX_ADC2_Init();
    MX_CAN2_Init();
    MX_CAN3_Init();
    MX_TIM4_Init();
    /* USER CODE BEGIN 2 */

    HAL_CAN_Start(&hcan1);
    if (HAL_CAN_ActivateNotification(&hcan1, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    HAL_CAN_Start(&hcan2);
    if (HAL_CAN_ActivateNotification(&hcan2, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    HAL_CAN_Start(&hcan3);
    if (HAL_CAN_ActivateNotification(&hcan3, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }

    startup_leds_animation();
    MovingAverage_Init();  // Initialize moving average buffers

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */

    // HAL_ADC_Start_DMA(&hadc1, ADC1_VAL, 4);
    HAL_ADC_Start_DMA(&hadc2, ADC2_APPS, 2);  // Start ADC2 for APPS
                                              // Calibrate APPS

    APPS_Init(__APPS_MIN_BITS, __APPS_MAX_BITS, __APPS_TOLERANCE, __APPS_DELTA);  // Initialize APPS

    printf("\n\n\n\n\n======================== RESET ========================\n\n\n\n\n\r");

#if CALIBRATE_APPS
    APPS_StartCalibration();
#endif

    while (1) {
        /* USER CODE END WHILE */
        
        /* USER CODE BEGIN 3 */
        heartbeat_nonblocking(GPIOB, LED_Heartbeat_Pin);

        static uint32_t previous_tick = 0;
        uint32_t current_tick = HAL_GetTick();
        if (current_tick - previous_tick >= 100) {
            // print the apps_funtion values

            send_vcu_heartbeat(&hcan1);
            send_vcu_heartbeat(&hcan2);
            send_vcu_heartbeat(&hcan3);

            result = APPS_Process(apps2_avg, apps1_avg);

#if CALIBRATE_APPS
            // If calibration is in progress, update it
            if (APPS_IsCalibrating()) {
                bool calibration_complete = APPS_Calibrate(apps1_avg, apps2_avg);
                if (calibration_complete) {
                    // Optionally, automatically apply the calibration
                    uint16_t min, max, tolerance, delta;
                    APPS_GetCalibrationValues(&min, &max, &tolerance, &delta);
                    APPS_Init(min, max, tolerance, delta);
                }
            }
#endif
#if print_apps
            APPS_PrintStatus();
#endif

            vcu.brake_pressure = MeasureBrakePressure(ADC1_VAL[0]);

